import asyncio
from telegram import Update
from telegram.ext import Application, CommandHandler, MessageHandler, filters, ContextTypes
from tokentelegram import token

# Токен от BotFather
BOT_TOKEN = token

async def start_command(update: Update, context: ContextTypes.DEFAULT_TYPE):
    """Обработчик команды /start"""
    welcome_text = """
🤖 Привет! Я Бизнес-Помощник!

Я могу помочь с:
• Налогами и финансами
• Договорами и документами  
• Маркетингом и продажами
• Расчетами и аналитикой

Просто задайте свой бизнес-вопрос!
    """
    await update.message.reply_text(welcome_text)

async def help_command(update: Update, context: ContextTypes.DEFAULT_TYPE):
    """Обработчик команды /help"""
    help_text = """
💡 Примеры вопросов:
• "Как рассчитать наценку?"
• "Какие налоги для ИП?"
• "Как составить договор?" 
• "Советы по маркетингу"

Задайте любой бизнес-вопрос!
    """
    await update.message.reply_text(help_text)

async def handle_message(update: Update, context: ContextTypes.DEFAULT_TYPE):
    """Обработчик текстовых сообщений"""
    user_message = update.message.text.lower()
    
    # Простые ответы без внешнего API
    answers = {
        "наценка": "Формула наценки: (Цена продажи - Себестоимость) / Себестоимость × 100%. Пример: купили за 100 руб, продали за 150 руб. Наценка = (150-100)/100 × 100% = 50%",
        "налог": "Для ИП основные режимы: УСН 6% (доходы) или УСН 15% (доходы-расходы). Также есть патент и ОСНО.",
        "договор": "Договор должен содержать: наименование сторон, предмет договора, сроки, стоимость, обязанности сторон, реквизиты.",
        "маркетинг": "Для продвижения используйте: соцсети, сарафанное радио, акции для постоянных клиентов, SEO-оптимизацию сайта.",
        "финанс": "Ведите учет доходов/расходов, составляйте бюджет, анализируйте рентабельность товаров/услуг."
    }
    
    # Ищем подходящий ответ
    answer = "Задайте вопрос про: налоги, договоры, маркетинг, финансы или расчет наценки."
    for key in answers:
        if key in user_message:
            answer = answers[key]
            break
    
    await update.message.reply_text(answer)

async def error_handler(update: Update, context: ContextTypes.DEFAULT_TYPE):
    """Обработчик ошибок"""
    print(f"Ошибка: {context.error}")
    await update.message.reply_text("❌ Произошла ошибка, попробуйте позже")

def main():
    """Запуск бота"""
    # Создаем приложение
    application = Application.builder().token(BOT_TOKEN).build()
    
    # Добавляем обработчики
    application.add_handler(CommandHandler("start", start_command))
    application.add_handler(CommandHandler("help", help_command))
    application.add_handler(MessageHandler(filters.TEXT & ~filters.COMMAND, handle_message))
    
    # Обработчик ошибок
    application.add_error_handler(error_handler)
    
    print("🤖 Telegram бот запущен...")
    
    # Запускаем бота
    application.run_polling()

if __name__ == "__main__":
    main()
